rkz/extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПроизводственногоПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроизводственныхПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПереданВПроизводство</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПричинаОтмены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтменыПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаАктивовПассивов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимостиНаЕдиницу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СписатьНаРасходы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КлючНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

rkz/extension/Documents/ЗаказНаПроизводство2_2/Ext/ObjectModule.bsl
&После("ОбработкаЗаполнения")
Процедура бит_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9/12] [ASHolyavko@1cbit.ru] [19.08.2024] +        
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Основание") Тогда // создание на основании заказа	
			ТипОснования = ТипЗнч(ДанныеЗаполнения.Основание);
			Если ТипОснования = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				Комментарий = ДанныеЗаполнения.Основание.Комментарий;
				бит_Толеранс = ДанныеЗаполнения.Основание.бит_Толеранс;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ9/12] [ASHolyavko@1cbit.ru] [19.08.2024] -
	
КонецПроцедуры  

&После("ОбработкаПроверкиЗаполнения")
Процедура бит_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +  
		
	Если ЭтотОбъект.бит_ПереданВПроизводство = Дата('00010101') 
		И (ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству ИЛИ ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовНаПроизводство2_2.Закрыт) Тогда
		
		//Заказы с пустой датой передачи в производство не содержащие суточную номенклатуру нельзя переводить в рабочие статусы
		Если НЕ бит_ЗаказСодержитНоменклатуруНеВключатьВСуточныйПакет() Тогда
			ОбщегоНазначения.СообщитьПользователю("Необходимо заполнить реквизит ""Перадан в производство"" (ЛТ29)");   
			Отказ = ИСТИНА;
			Возврат; 	
		КонецЕсли;
		
		//Нельзя очищать дату передачи в производство в рабочих заказах
		Если НЕ Ссылка.бит_ПереданВПроизводство = Дата('00010101') Тогда
			ОбщегоНазначения.СообщитьПользователю("Нельзя очищать реквизит ""Перадан в производство"" в заказ в статусах ""К производству"" или ""Закрыт"" (ЛТ29)");   
			Отказ = ИСТИНА;                                                                     	
			Возврат; 	
		КонецЕсли;
		
	КонецЕсли;		
	
	// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецПроцедуры

&НаСервере
Функция бит_ЗаказСодержитНоменклатуруНеВключатьВСуточныйПакет() Экспорт
	
// }}ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +      
	
	ПродукцияЗаказа = Новый ТаблицаЗначений;
	ПродукцияЗаказа = ЭтотОбъект.Продукция.Выгрузить(,"Номенклатура");
	
	//Находим всех родителей номенклатуры, т.к. нет типовой функции 
	
	ЗапросРодителиНоменклатуры = Новый Запрос("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Родитель КАК Родитель
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Номенклатура)
		|ИТОГИ ПО
		|	Родитель ТОЛЬКО ИЕРАРХИЯ");
	
	ЗапросРодителиНоменклатуры.УстановитьПараметр("Номенклатура", ПродукцияЗаказа);
	
	РезультатЗапроса = ЗапросРодителиНоменклатуры.Выполнить();
	РодителиНоменклатуры = РезультатЗапроса.Выгрузить();  
	
	//Смотрим есть ли элементы в бит_НеВключатьВСуточныйПакет 
	
	ЗапросНеВключатьВСуточныйПакет = Новый Запрос("ВЫБРАТЬ
	                                              |	бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры КАК ГруппаНоменклатуры
	                                              |ИЗ
	                                              |	Справочник.бит_НеВключатьВСуточныйПакет КАК бит_НеВключатьВСуточныйПакет
	                                              |ГДЕ
	                                              |	бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры В(&ГруппаНоменклатуры)
	                                              |	И НЕ бит_НеВключатьВСуточныйПакет.ПометкаУдаления");

	ЗапросНеВключатьВСуточныйПакет.УстановитьПараметр("ГруппаНоменклатуры", РодителиНоменклатуры);   
	
	РезультатЗапроса = ЗапросНеВключатьВСуточныйПакет.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда 
		Возврат ЛОЖЬ;		
	Иначе 
		Возврат ИСТИНА;		
	КонецЕсли;	
	
// }}ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] - 
	
КонецФункции

&После("ОбработкаПроведения")
Процедура бит_ОбработкаПроведения(Отказ, РежимПроведения) 
	
	// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +
		
	Если ЭтотОбъект.бит_ПереданВПроизводство = Дата('00010101') Тогда	
			
		ОчисткаЗаписей = РегистрыСведений.бит_ПакетыЗаказовВПроизводство.СоздатьНаборЗаписей();
		ОчисткаЗаписей.Отбор.ЗаказНаПроизводство.Установить(ЭтотОбъект.Ссылка);
		ОчисткаЗаписей.Записать();
		
	Иначе
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	бит_ПакетыЗаказовВПроизводствоСрезПоследних.Период КАК Период,
		|	бит_ПакетыЗаказовВПроизводствоСрезПоследних.ЗаказНаПроизводство КАК ЗаказНаПроизводство
		|ИЗ
		|	РегистрСведений.бит_ПакетыЗаказовВПроизводство.СрезПоследних(, ЗаказНаПроизводство = &ЗаказНаПроизводство И Период = &Дата) КАК бит_ПакетыЗаказовВПроизводствоСрезПоследних");
		
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.бит_ПереданВПроизводство);
		Запрос.УстановитьПараметр("ЗаказНаПроизводство", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить(); 
		
		Если РезультатЗапроса.Пустой() Тогда 	
			Запись = РегистрыСведений.бит_ПакетыЗаказовВПроизводство.СоздатьНаборЗаписей();
			Запись.Отбор.ЗаказНаПроизводство.Установить(ЭтотОбъект.Ссылка);
			
			НоваяЗапись = Запись.Добавить(); 
			НоваяЗапись.Период 				= ЭтотОбъект.бит_ПереданВПроизводство; 
			НоваяЗапись.ЗаказНаПроизводство = ЭтотОбъект.Ссылка; 
			НоваяЗапись.НомерПакета 		= 0;  
			
			Запись.Записать();	
		КонецЕсли;
		
	КонецЕсли;
		
	// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецПроцедуры

&После("ПриКопировании")
Процедура бит_ПриКопировании(ОбъектКопирования) 
	
// ПервыйБИТ ЛТ [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +       	
	бит_ПереданВПроизводство = Дата("00010101");
// ПервыйБИТ ЛТ [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -  

КонецПроцедуры
